tutorials/heatTransfer/chtMultiRegionFoam/coolingCylinder2D/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "$FOAM_CASE/system/blockMeshDict"

actions
(
    {
        name    cs;
        type    cellSet;
        action  new;
        source  cylinderToCell;
        point1  (0 0 -100);
        point2  (0 0  100);
        centre  (0 0 0);
        radius  $cylinderRadius;
    }
    {
        name    solid;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set     cs;
    }
);

// ************************************************************************* //
